Catalogs/ГруппыНалоговогоУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ГруппыНалоговогоУчетаОС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВГруппеОС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговогоУчетаВГруппахОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаАмортизацииДополнительная</Name>
					<Comment>Для объектов группы 5 после 20 лет экплуатации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СведенияОГруппахОсновныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СведенияОГруппахОсновныхСредств</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НормаАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВычетНаРемонт</Name>
					<Comment>Предельная норма отнесения на вычета расходов на ремонт</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыНалоговогоУчетаОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНалоговогоУчетаВГруппахОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНалоговогоУчетаВГруппахОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоОбъектам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГруппе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ГруппыНалоговогоУчетаОС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	// Заполнение справочника ГруппыОСНУ  	
	// I группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа1;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = "Легковые автомобили; автотракторная техника, спец/инструменты, инвентарь; компьютеры";
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоГруппе;
	СправочникОбъект.НормаАмортизации	= 30;	
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 20, 30);
	
	// II группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа2;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = "Машины и оборудование, подвижной состав автомобильного транспорта, мебель для офиса";
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоГруппе;
	СправочникОбъект.НормаАмортизации	= 25; 
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 20, 25);
	
	// III группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа3;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = "Другие ОС, подлежащие амортизации и расходы, приравненные к ним";
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоГруппе;
	СправочникОбъект.НормаАмортизации	= 20;  
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 20, 20);
	
	// IV группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа4;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = "Железнодорожные, морские и речные транспортные средства, силовые установки, устройства электропередачи";
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоГруппе;
	СправочникОбъект.НормаАмортизации	= 10;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 20, 10);		
	
	// V группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа5;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = "Здания, сооружения, строения";
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоОбъектам;
	СправочникОбъект.НормаАмортизации	= 10;
	СправочникОбъект.НормаАмортизацииДополнительная	= 20;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 20, 10);
	
	// VI группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа6;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = "Геологическая подготовка месторождений, ОС горнодобывающих(-перерабатывающих) предприятий";
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоОбъектам;
	СправочникОбъект.НормаАмортизации	= 50;     
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 20, 50);
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

Процедура СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, ВычетНаРемонт, НормаАмортизации)
	
	НаборЗаписей = РегистрыСведений.СведенияОГруппахОсновныхСредств.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.ВидСравнения 		= ВидСравнения.Равно;		
	НаборЗаписей.Отбор.Период.Значение	 		= '20060101';		
	НаборЗаписей.Отбор.ГруппаОС.ВидСравнения 	= ВидСравнения.Равно;		
	НаборЗаписей.Отбор.ГруппаОС.Значение	 	= ГруппаОС;		
	НаборЗаписей.Отбор.Период.Использование = Истина;		
	НаборЗаписей.Отбор.ГруппаОС.Использование = Истина;
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = '20060101';
	Запись.ГруппаОС = ГруппаОС;
	Запись.ВычетНаРемонт = ВычетНаРемонт;
	Запись.НормаАмортизации = НормаАмортизации;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
	
	
#КонецЕсли
